12/data/attachments/7d22b28a1cd494f1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2f60d643-61c0-4ce1-9600-b776e76ef1cb</nif:username>
            <nif:friendToBeAdded>Tyler_son_Friend_53696_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>